console.log(aa);
var aa = 100;

function cc() {
	var aa = 10;
	console.log(aa);
}

cc();

const p1 = Promise.resolve(123);
const p2 = new Promise(resolve => {
	console.log('p2')
	resolve(true);
})
const p3 = new Promise(resolve => {
	console.log('p3')
	resolve(true);
})
const p4 = Promise.resolve('122')

Promise.all([p1, p2, p3, p4]).then(res => {
	console.log(res, 'resolve');
}).catch(err => {
	console.log(err, 'reject');
})


let aad = '一般项目：食品销售（仅销售预包装食品）；农副产品销售；日用百货销售；家用电器销售；针纺织品及原料销售；塑料制品销售；办公设备销售；助动自行车、代步车及零配件销售；保健食品（预包装）销售；卫生用品和一次性使用医疗用品销售；家具零配件销售；新鲜水果零售；食用农产品零售；新鲜蔬菜零售；鲜肉零售；鲜蛋零售；针纺织品销售；服装服饰零售；化妆品零售；鞋帽零售；个人卫生用品销售；厨具卫具及日用杂品零售；日用品销售；礼品花卉销售；母婴用品销售；钟表销售；眼镜销售（不含隐形眼镜）；箱包销售；文具用品零售；自行车及零配件零售；体育用品及器材零售；户外用品销售；珠宝首饰零售；玩具、动漫及游艺用品销售；二手日用百货销售；乐器零售；日用家电零售；五金产品零售；灯具销售；家具销售；旧货销售；卫生洁具销售；宠物食品及用品零售；互联网销售（除销售需要许可的商品）；可穿戴智能设备销售；电子产品销售；软件销售；玩具销售；网络设备销售；纸制品销售；日用杂品销售；日用木制品销售；办公用品销售；茶具销售；食品互联网销售（仅销售预包装食品）；日用化学产品销售；成人情趣用品销售（不含药品、医疗器械）；渔具销售；卫生用杀虫剂销售；美发饰品销售；木制玩具销售；刀具销售；技术进出口；软件外包服务；软件开发；服装辅料销售；竹制品销售；棕制品销售；办公设备耗材销售；计算器设备销售；厨具卫具及日用杂品批发；日用口罩（非医用）销售；日用品批发；家用电器零配件销售；传统香料制品经营；产业用纺织制成品销售；日用陶瓷制品销售；卫生陶瓷制品销售；日用玻璃制品销售；草及相关制品销售；藤制品销售；软木制品销售；食品用洗涤剂销售；刀剑工艺品销售；'
console.log(aad.length, 'aad')
